In [ ]:
from datetime import datetime

In [ ]:
import pandas as pd


dates = pd.read_csv('dates.csv', sep=',')
movies = pd.read_csv('movies.csv', sep=',')
ratings1 = pd.read_csv('ratings1.csv', sep=',')
ratings2 = pd.read_csv('ratings2.csv', sep=',')

In [ ]:
movies['movieId'].nunique()

9742

In [ ]:
ratings1['userId'].nunique()

274

In [ ]:
dates.loc[:, 'date'] = pd.to_datetime(dates['date'])
dates.dtypes

date    datetime64[ns]
dtype: object

In [ ]:
dates['date'].dt.year.mode()

0    2000
dtype: int64

In [ ]:
ratings = pd.concat(
    [ratings1, ratings2],
    ignore_index=True
)
display(ratings)

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

In [ ]:
print('Число строк в таблице ratings: ', ratings.shape[0])
print('Число строк в таблице dates: ', dates.shape[0])
print(ratings.shape[0] == dates.shape[0])

# Число строк в таблице ratings: 100837
# Число строк в таблице dates: 100836
# False

Число строк в таблице ratings:  100837
Число строк в таблице dates:  100836
False

In [ ]:
dates.tail(2)

                      date
100834 2017-05-03 21:19:12
100835 2017-05-03 21:20:15

In [ ]:
display(ratings1.tail(1))
display(ratings2.head(1))

       userId  movieId  rating
40000     274     5621     2.0

   userId  movieId  rating
0     274     5621     2.0

In [ ]:
ratings = ratings.drop_duplicates(ignore_index=True)
print('Число строк в таблице ratings: ', ratings.shape[0])
# Число строк в таблице ratings: 100836

Число строк в таблице ratings:  100836

In [ ]:
ratings_dates = pd.concat([ratings, dates], axis=1)
display(ratings_dates.tail(7))

        userId  movieId  rating                date
100829     610   164179     5.0 2017-05-03 21:07:11
100830     610   166528     4.0 2017-05-04 06:29:25
100831     610   166534     4.0 2017-05-03 21:53:22
100832     610   168248     5.0 2017-05-03 22:21:31
100833     610   168250     5.0 2017-05-08 19:50:47
100834     610   168252     5.0 2017-05-03 21:19:12
100835     610   170875     3.0 2017-05-03 21:20:15

In [ ]:
df1 = pd.DataFrame({"Name": ["Pankaj", "Lisa"], "Surname": ["Sobolev", "Krasnova"]})
df2 = pd.DataFrame({"Role": ["Admin", "Editor"]})

In [ ]:
df1

     Name   Surname
0  Pankaj   Sobolev
1    Lisa  Krasnova

In [ ]:
df2

     Role
0   Admin
1  Editor

In [ ]:
# Задание 23.3 (Внешний источник)
import os

os.listdir()

['.config',
 'movies.csv',
 'ratings1.csv',
 'ratings2.csv',
 'dates.csv',
 'sample_data']

In [ ]:
# 23.3 {"name":"OperationalError","message":"certificate has expired",

import pandas as pd
import os

def concat_users_files(path):
    """
    Вам необходимо написать функцию concat_user_files(path), параметром которой 
    является path - путь до директории. 
    Функция должна объединить информацию из предоставленных вам файлов в один 
    DataFrame и вернуть его. 
    Не забудьте обновить индексы результирующей таблицы после объединения.
    Учтите тот момент, что в результате объединения могут возникнуть дубликаты, 
    от которых необходимо будет избавиться. 
    """
    dfs = []
    files = sorted(os.listdir(path))
    files = [f for f in files if f.endswith('.csv')]
    for f in files:
        dfs.append(pd.read_csv(os.path.join(path, f), sep=','))
    
    df = pd.concat(dfs, ignore_index=True)
    
    df = df.drop_duplicates()
    df.reset_index(drop=True)
    
    return df


if __name__ == '__main__':
    # print(pd.__version__)
    data = concat_users_files('./Root/users/')
    print(data.shape)
    print(data)

In [ ]:
joined = ratings_dates.join(
    movies.set_index('movieId'),
    on='movieId',
    how='left'
)
display(joined.head())

   userId  ...                                       genres
0       1  ...  Adventure|Animation|Children|Comedy|Fantasy
1       1  ...                               Comedy|Romance
2       1  ...                        Action|Crime|Thriller
3       1  ...                             Mystery|Thriller
4       1  ...                       Crime|Mystery|Thriller

[5 rows x 6 columns]

In [ ]:
merged = ratings_dates.merge(
    movies,
    on='movieId',
    how='left'
)
display(merged.head())

   userId  ...                                       genres
0       1  ...  Adventure|Animation|Children|Comedy|Fantasy
1       1  ...                               Comedy|Romance
2       1  ...                        Action|Crime|Thriller
3       1  ...                             Mystery|Thriller
4       1  ...                       Crime|Mystery|Thriller

[5 rows x 6 columns]

In [ ]:
print('Число строк в таблице ratings_dates: ', ratings_dates.shape[0])
print('Число строк в таблице merged: ', merged.shape[0])
print(ratings_dates.shape[0] == merged.shape[0])

# Число строк в таблице ratings_dates: 100836
# Число строк в таблице merged: 100836
# True

Число строк в таблице ratings_dates:  100836
Число строк в таблице merged:  100836
True

In [ ]:
# Задание 24.3

# Даны две исходные таблицы:

data_1 = pd.DataFrame({'Value': [100, 45, 80],
                       'Group': [1, 4, 5]},
                      index = ['I0', 'I1', 'I2']
                     )
data_2 = pd.DataFrame({'Company': ['Google', 'Amazon', 'Facebook'],
                       'Add': ['S0', 'S1', 'S7']},
                      index = ['I0', 'I1', 'I3']
                     )

display(data_1)

    Value  Group
I0    100      1
I1     45      4
I2     80      5

In [ ]:
display(data_2)

     Company Add
I0    Google  S0
I1    Amazon  S1
I3  Facebook  S7

In [ ]:
data_1.join(data_2, how='inner')

    Value  Group Company Add
I0    100      1  Google  S0
I1     45      4  Amazon  S1

In [ ]:
data_1.merge(data_2, how='inner', right_index=True, left_index=True)

    Value  Group Company Add
I0    100      1  Google  S0
I1     45      4  Amazon  S1

In [ ]:
# Задание 24.4

# Даны две исходные таблицы:
a = pd.DataFrame({'A': ['a', 'b', 'c'], 'B': [103, 214, 124], 'C': [1, 4, 2]})
b = pd.DataFrame({'V': ['d', 'b', 'c'], 'U': [1393.7, 9382.2, 1904.5], 'C': [1, 3, 2]})

In [ ]:
display(a)
display(b)

   A    B  C
0  a  103  1
1  b  214  4
2  c  124  2

   V       U  C
0  d  1393.7  1
1  b  9382.2  3
2  c  1904.5  2

In [ ]:
a.merge(b, how='right', on='C')

     A      B  C  V       U
0    a  103.0  1  d  1393.7
1  NaN    NaN  3  b  9382.2
2    c  124.0  2  c  1904.5